### ✅ Terraform Plan

<details><summary>Show Plan</summary>

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_acm_certificate.wiki will be created
  + resource "aws_acm_certificate" "wiki" {
      + arn                       = (known after apply)
      + domain_name               = "placeholder.example.com"
      + domain_validation_options = [
          + {
              + domain_name           = "placeholder.example.com"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "placeholder.example.com",
        ]
      + tags                      = {
          + "Name"        = "placeholder.example.com"
          + "environment" = "shared-services"
        }
      + tags_all                  = {
          + "Name"        = "placeholder.example.com"
          + "environment" = "shared-services"
        }
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"

      + options (known after apply)
    }

  # aws_acm_certificate_validation.wiki will be created
  + resource "aws_acm_certificate_validation" "wiki" {
      + certificate_arn = (known after apply)
      + id              = (known after apply)
    }

  # aws_cloudfront_distribution.wiki will be created
  + resource "aws_cloudfront_distribution" "wiki" {
      + aliases                         = [
          + "placeholder.example.com",
        ]
      + arn                             = (known after apply)
      + caller_reference                = (known after apply)
      + comment                         = "Wiki.js — placeholder.example.com"
      + continuous_deployment_policy_id = (known after apply)
      + domain_name                     = (known after apply)
      + enabled                         = true
      + etag                            = (known after apply)
      + hosted_zone_id                  = (known after apply)
      + http_version                    = "http2"
      + id                              = (known after apply)
      + in_progress_validation_batches  = (known after apply)
      + is_ipv6_enabled                 = true
      + last_modified_time              = (known after apply)
      + price_class                     = "PriceClass_All"
      + retain_on_delete                = false
      + staging                         = false
      + status                          = (known after apply)
      + tags                            = {
          + "Name"        = "shared-services-wiki-cdn"
          + "environment" = "shared-services"
        }
      + tags_all                        = {
          + "Name"        = "shared-services-wiki-cdn"
          + "environment" = "shared-services"
        }
      + trusted_key_groups              = (known after apply)
      + trusted_signers                 = (known after apply)
      + wait_for_deployment             = true

      + default_cache_behavior {
          + allowed_methods            = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + cache_policy_id            = "4135ea2d-6df8-44a3-9df3-4b5a84be39ad"
          + cached_methods             = [
              + "GET",
              + "HEAD",
            ]
          + compress                   = true
          + default_ttl                = (known after apply)
          + max_ttl                    = (known after apply)
          + min_ttl                    = 0
          + origin_request_policy_id   = "216adef6-5c7f-47e4-b989-5492eafa07d3"
          + response_headers_policy_id = (known after apply)
          + target_origin_id           = "wiki-ec2"
          + trusted_key_groups         = (known after apply)
          + trusted_signers            = (known after apply)
          + viewer_protocol_policy     = "redirect-to-https"

          + grpc_config (known after apply)
        }

      + origin {
          + connection_attempts      = 3
          + connection_timeout       = 10
          + domain_name              = (known after apply)
          + origin_id                = "wiki-ec2"
            # (2 unchanged attributes hidden)

          + custom_origin_config {
              + http_port                = 3000
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "http-only"
              + origin_read_timeout      = 30
              + origin_ssl_protocols     = [
                  + "TLSv1.2",
                ]
            }
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + acm_certificate_arn      = (known after apply)
          + minimum_protocol_version = "TLSv1.2_2021"
          + ssl_support_method       = "sni-only"
        }
    }

  # aws_cloudfront_response_headers_policy.security will be created
  + resource "aws_cloudfront_response_headers_policy" "security" {
      + arn     = (known after apply)
      + comment = "Security headers for Wiki.js"
      + etag    = (known after apply)
      + id      = (known after apply)
      + name    = "shared-services-wiki-security-headers"

      + security_headers_config {
          + content_security_policy {
              + content_security_policy = "frame-ancestors 'none'"
              + override                = true
            }
          + content_type_options {
              + override = true
            }
          + frame_options {
              + frame_option = "DENY"
              + override     = true
            }
          + referrer_policy {
              + override        = true
              + referrer_policy = "strict-origin-when-cross-origin"
            }
          + strict_transport_security {
              + access_control_max_age_sec = 31536000
              + include_subdomains         = true
              + override                   = true
              + preload                    = true
            }
          + xss_protection {
              + mode_block = true
              + override   = true
              + protection = true
            }
        }
    }

  # aws_default_network_acl.default will be created
  + resource "aws_default_network_acl" "default" {
      + arn                    = (known after apply)
      + default_network_acl_id = (known after apply)
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + tags                   = {
          + "Name"        = "shared-services-default-nacl-restricted"
          + "environment" = "shared-services"
        }
      + tags_all               = {
          + "Name"        = "shared-services-default-nacl-restricted"
          + "environment" = "shared-services"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_default_security_group.default will be created
  + resource "aws_default_security_group" "default" {
      + arn                    = (known after apply)
      + description            = (known after apply)
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"        = "shared-services-default-sg-restricted"
          + "environment" = "shared-services"
        }
      + tags_all               = {
          + "Name"        = "shared-services-default-sg-restricted"
          + "environment" = "shared-services"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_iam_instance_profile.wiki will be created
  + resource "aws_iam_instance_profile" "wiki" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "shared-services-wiki-ec2"
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = "shared-services-wiki-ec2"
      + tags_all    = (known after apply)
      + unique_id   = (known after apply)
    }

  # aws_iam_role.scheduler[0] will be created
  + resource "aws_iam_role" "scheduler" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "scheduler.amazonaws.com"
                        }
                    },
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ssm.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "shared-services-wiki-scheduler"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "environment" = "shared-services"
        }
      + tags_all              = {
          + "environment" = "shared-services"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role.wiki will be created
  + resource "aws_iam_role" "wiki" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "shared-services-wiki-ec2"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "environment" = "shared-services"
        }
      + tags_all              = {
          + "environment" = "shared-services"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy.scheduler[0] will be created
  + resource "aws_iam_role_policy" "scheduler" {
      + id          = (known after apply)
      + name        = "wiki-scheduler"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "shared-services-wiki-scheduler"
    }

  # aws_iam_role_policy_attachment.ssm will be created
  + resource "aws_iam_role_policy_attachment" "ssm" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"
      + role       = "shared-services-wiki-ec2"
    }

  # aws_instance.wiki will be created
  + resource "aws_instance" "wiki" {
      + ami                                  = (sensitive value)
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + enable_primary_ipv6                  = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = "shared-services-wiki-ec2"
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Name"        = "shared-services-wiki"
          + "environment" = "shared-services"
        }
      + tags_all                             = {
          + "Name"        = "shared-services-wiki"
          + "environment" = "shared-services"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "af5602bcf55195ea2408d7604435199ca5a2e87f"
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification (known after apply)

      + cpu_options (known after apply)

      + ebs_block_device (known after apply)

      + enclave_options (known after apply)

      + ephemeral_block_device (known after apply)

      + instance_market_options (known after apply)

      + maintenance_options (known after apply)

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = "disabled"
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = "required"
          + instance_metadata_tags      = (known after apply)
        }

      + network_interface (known after apply)

      + private_dns_name_options (known after apply)

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags_all              = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = 20
          + volume_type           = "gp3"
        }
    }

  # aws_internet_gateway.main will be created
  + resource "aws_internet_gateway" "main" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name"        = "shared-services-igw"
          + "environment" = "shared-services"
        }
      + tags_all = {
          + "Name"        = "shared-services-igw"
          + "environment" = "shared-services"
        }
      + vpc_id   = (known after apply)
    }

  # aws_network_acl.private will be created
  + resource "aws_network_acl" "private" {
      + arn        = (known after apply)
      + egress     = [
          + {
              + action          = "allow"
              + cidr_block      = "10.0.0.0/16"
              + from_port       = 0
              + protocol        = "-1"
              + rule_no         = 100
              + to_port         = 0
                # (1 unchanged attribute hidden)
            },
          + {
              + action          = "deny"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 0
              + protocol        = "-1"
              + rule_no         = 200
              + to_port         = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id         = (known after apply)
      + ingress    = [
          + {
              + action          = "allow"
              + cidr_block      = "10.0.0.0/16"
              + from_port       = 0
              + protocol        = "-1"
              + rule_no         = 100
              + to_port         = 0
                # (1 unchanged attribute hidden)
            },
          + {
              + action          = "deny"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 0
              + protocol        = "-1"
              + rule_no         = 200
              + to_port         = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + owner_id   = (known after apply)
      + subnet_ids = (known after apply)
      + tags       = {
          + "Name"        = "shared-services-private-nacl"
          + "environment" = "shared-services"
        }
      + tags_all   = {
          + "Name"        = "shared-services-private-nacl"
          + "environment" = "shared-services"
        }
      + vpc_id     = (known after apply)
    }

  # aws_network_acl.public will be created
  + resource "aws_network_acl" "public" {
      + arn        = (known after apply)
      + egress     = [
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 0
              + protocol        = "-1"
              + rule_no         = 100
              + to_port         = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id         = (known after apply)
      + ingress    = [
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 1024
              + protocol        = "tcp"
              + rule_no         = 120
              + to_port         = 65535
                # (1 unchanged attribute hidden)
            },
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 443
              + protocol        = "tcp"
              + rule_no         = 110
              + to_port         = 443
                # (1 unchanged attribute hidden)
            },
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 80
              + protocol        = "tcp"
              + rule_no         = 100
              + to_port         = 80
                # (1 unchanged attribute hidden)
            },
          + {
              + action          = "deny"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 3389
              + protocol        = "tcp"
              + rule_no         = 130
              + to_port         = 3389
                # (1 unchanged attribute hidden)
            },
        ]
      + owner_id   = (known after apply)
      + subnet_ids = (known after apply)
      + tags       = {
          + "Name"        = "shared-services-public-nacl"
          + "environment" = "shared-services"
        }
      + tags_all   = {
          + "Name"        = "shared-services-public-nacl"
          + "environment" = "shared-services"
        }
      + vpc_id     = (known after apply)
    }

  # aws_route_table.private will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name"        = "shared-services-private-rt"
          + "environment" = "shared-services"
        }
      + tags_all         = {
          + "Name"        = "shared-services-private-rt"
          + "environment" = "shared-services"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.public will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + cidr_block                 = "0.0.0.0/0"
              + gateway_id                 = (known after apply)
                # (11 unchanged attributes hidden)
            },
        ]
      + tags             = {
          + "Name"        = "shared-services-public-rt"
          + "environment" = "shared-services"
        }
      + tags_all         = {
          + "Name"        = "shared-services-public-rt"
          + "environment" = "shared-services"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.private[2] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public[2] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_scheduler_schedule.wiki_start[0] will be created
  + resource "aws_scheduler_schedule" "wiki_start" {
      + arn                          = (known after apply)
      + group_name                   = (known after apply)
      + id                           = (known after apply)
      + name                         = "shared-services-wiki-start"
      + name_prefix                  = (known after apply)
      + schedule_expression          = "cron(0 5 ? * MON-FRI *)"
      + schedule_expression_timezone = "Australia/Brisbane"
      + state                        = "ENABLED"

      + flexible_time_window {
          + mode = "OFF"
        }

      + target {
          + arn      = "arn:aws:scheduler:::aws-sdk:ssm:startAutomationExecution"
          + input    = (known after apply)
          + role_arn = (known after apply)
        }
    }

  # aws_scheduler_schedule.wiki_stop[0] will be created
  + resource "aws_scheduler_schedule" "wiki_stop" {
      + arn                          = (known after apply)
      + group_name                   = (known after apply)
      + id                           = (known after apply)
      + name                         = "shared-services-wiki-stop"
      + name_prefix                  = (known after apply)
      + schedule_expression          = "cron(0 19 ? * MON-FRI *)"
      + schedule_expression_timezone = "Australia/Brisbane"
      + state                        = "ENABLED"

      + flexible_time_window {
          + mode = "OFF"
        }

      + target {
          + arn      = "arn:aws:scheduler:::aws-sdk:ssm:startAutomationExecution"
          + input    = (known after apply)
          + role_arn = (known after apply)
        }
    }

  # aws_security_group.wiki will be created
  + resource "aws_security_group" "wiki" {
      + arn                    = (known after apply)
      + description            = "Allow CloudFront to reach Wiki.js on port 3000"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "shared-services-wiki"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"        = "shared-services-wiki-sg"
          + "environment" = "shared-services"
        }
      + tags_all               = {
          + "Name"        = "shared-services-wiki-sg"
          + "environment" = "shared-services"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.101.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"        = "shared-services-private-ap-southeast-2a"
          + "environment" = "shared-services"
        }
      + tags_all                                       = {
          + "Name"        = "shared-services-private-ap-southeast-2a"
          + "environment" = "shared-services"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.102.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"        = "shared-services-private-ap-southeast-2b"
          + "environment" = "shared-services"
        }
      + tags_all                                       = {
          + "Name"        = "shared-services-private-ap-southeast-2b"
          + "environment" = "shared-services"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.private[2] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-2c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.103.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"        = "shared-services-private-ap-southeast-2c"
          + "environment" = "shared-services"
        }
      + tags_all                                       = {
          + "Name"        = "shared-services-private-ap-southeast-2c"
          + "environment" = "shared-services"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"        = "shared-services-public-ap-southeast-2a"
          + "environment" = "shared-services"
        }
      + tags_all                                       = {
          + "Name"        = "shared-services-public-ap-southeast-2a"
          + "environment" = "shared-services"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"        = "shared-services-public-ap-southeast-2b"
          + "environment" = "shared-services"
        }
      + tags_all                                       = {
          + "Name"        = "shared-services-public-ap-southeast-2b"
          + "environment" = "shared-services"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.public[2] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-2c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.3.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"        = "shared-services-public-ap-southeast-2c"
          + "environment" = "shared-services"
        }
      + tags_all                                       = {
          + "Name"        = "shared-services-public-ap-southeast-2c"
          + "environment" = "shared-services"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_vpc.main will be created
  + resource "aws_vpc" "main" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name"        = "shared-services-vpc"
          + "environment" = "shared-services"
        }
      + tags_all                             = {
          + "Name"        = "shared-services-vpc"
          + "environment" = "shared-services"
        }
    }

  # aws_vpc_security_group_egress_rule.all will be created
  + resource "aws_vpc_security_group_egress_rule" "all" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + description            = "All outbound"
      + id                     = (known after apply)
      + ip_protocol            = "-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags_all               = {}
    }

  # aws_vpc_security_group_ingress_rule.cloudfront will be created
  + resource "aws_vpc_security_group_ingress_rule" "cloudfront" {
      + arn                    = (known after apply)
      + description            = "Wiki.js from CloudFront"
      + from_port              = 3000
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + prefix_list_id         = "pl-b8a742d1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags_all               = {}
      + to_port                = 3000
    }

Plan: 35 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + acm_validation_records     = {
      + "placeholder.example.com" = {
          + name  = (known after apply)
          + type  = (known after apply)
          + value = (known after apply)
        }
    }
  + cloudfront_distribution_id = (known after apply)
  + cloudfront_domain_name     = (known after apply)
  + instance_id                = (known after apply)
  + private_subnet_ids         = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + public_subnet_ids          = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + vpc_id                     = (known after apply)

```

</details>